zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p401m_classic.h
/******************************************************************************
* CAPTIO1 Registers
******************************************************************************/
#define CAPTIO1CTL                               (HWREG16(0x4000580E))           /*!< Capacitive Touch IO x Control Register */

/* Register offsets from CAPTIO1_BASE address */
#define OFS_CAPTIO1CTL                                     (0x000E)              /*!< Capacitive Touch IO x Control Register */

#define CAPTIO1CTL_L                                       (HWREG8_L(CAPTIO1CTL))/* Capacitive Touch IO x Control Register */
#define CAPTIO1CTL_H                                       (HWREG8_H(CAPTIO1CTL))/* Capacitive Touch IO x Control Register */

/******************************************************************************
* COMP_E0 Registers
******************************************************************************/
#define CE0CTL0                                  (HWREG16(0x40003400))           /*!< Comparator Control Register 0 */
#define CE0CTL1                                  (HWREG16(0x40003402))           /*!< Comparator Control Register 1 */
#define CE0CTL2                                  (HWREG16(0x40003404))           /*!< Comparator Control Register 2 */
#define CE0CTL3                                  (HWREG16(0x40003406))           /*!< Comparator Control Register 3 */
#define CE0INT                                   (HWREG16(0x4000340C))           /*!< Comparator Interrupt Control Register */
#define CE0IV                                    (HWREG16(0x4000340E))           /*!< Comparator Interrupt Vector Word Register */

/* Register offsets from COMP_E0_BASE address */
#define OFS_CE0CTL0                                        (0x0000)              /*!< Comparator Control Register 0 */
#define OFS_CE0CTL1                                        (0x0002)              /*!< Comparator Control Register 1 */
#define OFS_CE0CTL2                                        (0x0004)              /*!< Comparator Control Register 2 */
#define OFS_CE0CTL3                                        (0x0006)              /*!< Comparator Control Register 3 */
#define OFS_CE0INT                                         (0x000C)              /*!< Comparator Interrupt Control Register */
#define OFS_CE0IV                                          (0x000E)              /*!< Comparator Interrupt Vector Word Register */


/******************************************************************************
* COMP_E1 Registers
******************************************************************************/
#define CE1CTL0                                  (HWREG16(0x40003800))           /*!< Comparator Control Register 0 */
#define CE1CTL1                                  (HWREG16(0x40003802))           /*!< Comparator Control Register 1 */
#define CE1CTL2                                  (HWREG16(0x40003804))           /*!< Comparator Control Register 2 */
#define CE1CTL3                                  (HWREG16(0x40003806))           /*!< Comparator Control Register 3 */
#define CE1INT                                   (HWREG16(0x4000380C))           /*!< Comparator Interrupt Control Register */
#define CE1IV                                    (HWREG16(0x4000380E))           /*!< Comparator Interrupt Vector Word Register */

/* Register offsets from COMP_E1_BASE address */
#define OFS_CE1CTL0                                        (0x0000)              /*!< Comparator Control Register 0 */
#define OFS_CE1CTL1                                        (0x0002)              /*!< Comparator Control Register 1 */
#define OFS_CE1CTL2                                        (0x0004)              /*!< Comparator Control Register 2 */
#define OFS_CE1CTL3                                        (0x0006)              /*!< Comparator Control Register 3 */
#define OFS_CE1INT                                         (0x000C)              /*!< Comparator Interrupt Control Register */
#define OFS_CE1IV                                          (0x000E)              /*!< Comparator Interrupt Vector Word Register */


/******************************************************************************
* CRC32 Registers
******************************************************************************/
#define CRC32DI                                  (HWREG16(0x40004000))           /*!< Data Input for CRC32 Signature Computation */
#define CRC32DIRB                                (HWREG16(0x40004004))           /*!< Data In Reverse for CRC32 Computation */
#define CRC32INIRES_LO                           (HWREG16(0x40004008))           /*!< CRC32 Initialization and Result, lower 16 bits */
#define CRC32INIRES_HI                           (HWREG16(0x4000400A))           /*!< CRC32 Initialization and Result, upper 16 bits */
#define CRC32RESR_LO                             (HWREG16(0x4000400C))           /*!< CRC32 Result Reverse, lower 16 bits */
#define CRC32RESR_HI                             (HWREG16(0x4000400E))           /*!< CRC32 Result Reverse, Upper 16 bits */
#define CRC16DI                                  (HWREG16(0x40004010))           /*!< Data Input for CRC16 computation */
#define CRC16DIRB                                (HWREG16(0x40004014))           /*!< CRC16 Data In Reverse */
#define CRC16INIRES                              (HWREG16(0x40004018))           /*!< CRC16 Initialization and Result register */
#define CRC16RESR                                (HWREG16(0x4000401E))           /*!< CRC16 Result Reverse */

/* Register offsets from CRC32_BASE address */
#define OFS_CRC32DI                                        (0x0000)              /*!< Data Input for CRC32 Signature Computation */
#define OFS_CRC32DIRB                                      (0x0004)              /*!< Data In Reverse for CRC32 Computation */
#define OFS_CRC32INIRES_LO                                 (0x0008)              /*!< CRC32 Initialization and Result, lower 16 bits */
#define OFS_CRC32INIRES_HI                                 (0x000A)              /*!< CRC32 Initialization and Result, upper 16 bits */
#define OFS_CRC32RESR_LO                                   (0x000C)              /*!< CRC32 Result Reverse, lower 16 bits */
#define OFS_CRC32RESR_HI                                   (0x000E)              /*!< CRC32 Result Reverse, Upper 16 bits */
#define OFS_CRC16DI                                        (0x0010)              /*!< Data Input for CRC16 computation */
#define OFS_CRC16DIRB                                      (0x0014)              /*!< CRC16 Data In Reverse */
#define OFS_CRC16INIRES                                    (0x0018)              /*!< CRC16 Initialization and Result register */
#define OFS_CRC16RESR                                      (0x001E)              /*!< CRC16 Result Reverse */


