zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p401m_classic.h
/******************************************************************************
* WDT_A Registers
******************************************************************************/
#define WDTCTL                                   (HWREG16(0x4000480C))           /*!< Watchdog Timer Control Register */

/* Register offsets from WDT_A_BASE address */
#define OFS_WDTCTL                                         (0x000C)              /*!< Watchdog Timer Control Register */


/******************************************************************************
* Peripheral register control bits (legacy section)                           *
******************************************************************************/

/******************************************************************************
* AES256 Bits (legacy section)
******************************************************************************/
/* AESACTL0[AESOP] Bits */
#define AESOP_OFS                                AES256_CTL0_OP_OFS              /*!< AESOP Offset */
#define AESOP_M                                  AES256_CTL0_OP_MASK             /*!< AES operation */
#define AESOP0                                   AES256_CTL0_OP0                 /*!< AESOP Bit 0 */
#define AESOP1                                   AES256_CTL0_OP1                 /*!< AESOP Bit 1 */
#define AESOP_0                                  AES256_CTL0_OP_0                /*!< Encryption */
#define AESOP_1                                  AES256_CTL0_OP_1                /*!< Decryption. The provided key is the same key used for encryption */
#define AESOP_2                                  AES256_CTL0_OP_2                /*!< Generate first round key required for decryption */
#define AESOP_3                                  AES256_CTL0_OP_3                /*!< Decryption. The provided key is the first round key required for decryption */
/* AESACTL0[AESKL] Bits */
#define AESKL_OFS                                AES256_CTL0_KL_OFS              /*!< AESKL Offset */
#define AESKL_M                                  AES256_CTL0_KL_MASK             /*!< AES key length */
#define AESKL0                                   AES256_CTL0_KL0                 /*!< AESKL Bit 0 */
#define AESKL1                                   AES256_CTL0_KL1                 /*!< AESKL Bit 1 */
#define AESKL_0                                  AES256_CTL0_KL_0                /*!< AES128. The key size is 128 bit */
#define AESKL_1                                  AES256_CTL0_KL_1                /*!< AES192. The key size is 192 bit. */
#define AESKL_2                                  AES256_CTL0_KL_2                /*!< AES256. The key size is 256 bit */
#define AESKL__128BIT                            AES256_CTL0_KL__128BIT          /*!< AES128. The key size is 128 bit */
#define AESKL__192BIT                            AES256_CTL0_KL__192BIT          /*!< AES192. The key size is 192 bit. */
#define AESKL__256BIT                            AES256_CTL0_KL__256BIT          /*!< AES256. The key size is 256 bit */
/* AESACTL0[AESCM] Bits */
#define AESCM_OFS                                AES256_CTL0_CM_OFS              /*!< AESCM Offset */
#define AESCM_M                                  AES256_CTL0_CM_MASK             /*!< AES cipher mode select */
#define AESCM0                                   AES256_CTL0_CM0                 /*!< AESCM Bit 0 */
#define AESCM1                                   AES256_CTL0_CM1                 /*!< AESCM Bit 1 */
#define AESCM_0                                  AES256_CTL0_CM_0                /*!< ECB */
#define AESCM_1                                  AES256_CTL0_CM_1                /*!< CBC */
#define AESCM_2                                  AES256_CTL0_CM_2                /*!< OFB */
#define AESCM_3                                  AES256_CTL0_CM_3                /*!< CFB */
#define AESCM__ECB                               AES256_CTL0_CM__ECB             /*!< ECB */
#define AESCM__CBC                               AES256_CTL0_CM__CBC             /*!< CBC */
#define AESCM__OFB                               AES256_CTL0_CM__OFB             /*!< OFB */
#define AESCM__CFB                               AES256_CTL0_CM__CFB             /*!< CFB */
/* AESACTL0[AESSWRST] Bits */
#define AESSWRST_OFS                             AES256_CTL0_SWRST_OFS           /*!< AESSWRST Offset */
#define AESSWRST                                 AES256_CTL0_SWRST               /*!< AES software reset */
/* AESACTL0[AESRDYIFG] Bits */
#define AESRDYIFG_OFS                            AES256_CTL0_RDYIFG_OFS          /*!< AESRDYIFG Offset */
#define AESRDYIFG                                AES256_CTL0_RDYIFG              /*!< AES ready interrupt flag */
/* AESACTL0[AESERRFG] Bits */
#define AESERRFG_OFS                             AES256_CTL0_ERRFG_OFS           /*!< AESERRFG Offset */
#define AESERRFG                                 AES256_CTL0_ERRFG               /*!< AES error flag */
/* AESACTL0[AESRDYIE] Bits */
#define AESRDYIE_OFS                             AES256_CTL0_RDYIE_OFS           /*!< AESRDYIE Offset */
#define AESRDYIE                                 AES256_CTL0_RDYIE               /*!< AES ready interrupt enable */
/* AESACTL0[AESCMEN] Bits */
#define AESCMEN_OFS                              AES256_CTL0_CMEN_OFS            /*!< AESCMEN Offset */
#define AESCMEN                                  AES256_CTL0_CMEN                /*!< AES cipher mode enable */
/* AESACTL1[AESBLKCNT] Bits */
#define AESBLKCNT_OFS                            AES256_CTL1_BLKCNT_OFS          /*!< AESBLKCNT Offset */
#define AESBLKCNT_M                              AES256_CTL1_BLKCNT_MASK         /*!< Cipher Block Counter */
#define AESBLKCNT0                               AES256_CTL1_BLKCNT0             /*!< AESBLKCNT Bit 0 */
#define AESBLKCNT1                               AES256_CTL1_BLKCNT1             /*!< AESBLKCNT Bit 1 */
#define AESBLKCNT2                               AES256_CTL1_BLKCNT2             /*!< AESBLKCNT Bit 2 */
#define AESBLKCNT3                               AES256_CTL1_BLKCNT3             /*!< AESBLKCNT Bit 3 */
#define AESBLKCNT4                               AES256_CTL1_BLKCNT4             /*!< AESBLKCNT Bit 4 */
#define AESBLKCNT5                               AES256_CTL1_BLKCNT5             /*!< AESBLKCNT Bit 5 */
#define AESBLKCNT6                               AES256_CTL1_BLKCNT6             /*!< AESBLKCNT Bit 6 */
#define AESBLKCNT7                               AES256_CTL1_BLKCNT7             /*!< AESBLKCNT Bit 7 */
/* AESASTAT[AESBUSY] Bits */
#define AESBUSY_OFS                              AES256_STAT_BUSY_OFS            /*!< AESBUSY Offset */
#define AESBUSY                                  AES256_STAT_BUSY                /*!< AES accelerator module busy */
/* AESASTAT[AESKEYWR] Bits */
#define AESKEYWR_OFS                             AES256_STAT_KEYWR_OFS           /*!< AESKEYWR Offset */
#define AESKEYWR                                 AES256_STAT_KEYWR               /*!< All 16 bytes written to AESAKEY */
/* AESASTAT[AESDINWR] Bits */
#define AESDINWR_OFS                             AES256_STAT_DINWR_OFS           /*!< AESDINWR Offset */
#define AESDINWR                                 AES256_STAT_DINWR               /*!< All 16 bytes written to AESADIN, AESAXDIN or AESAXIN */
/* AESASTAT[AESDOUTRD] Bits */
#define AESDOUTRD_OFS                            AES256_STAT_DOUTRD_OFS          /*!< AESDOUTRD Offset */
#define AESDOUTRD                                AES256_STAT_DOUTRD              /*!< All 16 bytes read from AESADOUT */
/* AESASTAT[AESKEYCNT] Bits */
#define AESKEYCNT_OFS                            AES256_STAT_KEYCNT_OFS          /*!< AESKEYCNT Offset */
#define AESKEYCNT_M                              AES256_STAT_KEYCNT_MASK         /*!< Bytes written via AESAKEY for AESKLx=00, half-words written via AESAKEY */
#define AESKEYCNT0                               AES256_STAT_KEYCNT0             /*!< AESKEYCNT Bit 0 */
#define AESKEYCNT1                               AES256_STAT_KEYCNT1             /*!< AESKEYCNT Bit 1 */
#define AESKEYCNT2                               AES256_STAT_KEYCNT2             /*!< AESKEYCNT Bit 2 */
#define AESKEYCNT3                               AES256_STAT_KEYCNT3             /*!< AESKEYCNT Bit 3 */
/* AESASTAT[AESDINCNT] Bits */
#define AESDINCNT_OFS                            AES256_STAT_DINCNT_OFS          /*!< AESDINCNT Offset */
#define AESDINCNT_M                              AES256_STAT_DINCNT_MASK         /*!< Bytes written via AESADIN, AESAXDIN or AESAXIN */
#define AESDINCNT0                               AES256_STAT_DINCNT0             /*!< AESDINCNT Bit 0 */
#define AESDINCNT1                               AES256_STAT_DINCNT1             /*!< AESDINCNT Bit 1 */
#define AESDINCNT2                               AES256_STAT_DINCNT2             /*!< AESDINCNT Bit 2 */
#define AESDINCNT3                               AES256_STAT_DINCNT3             /*!< AESDINCNT Bit 3 */
/* AESASTAT[AESDOUTCNT] Bits */
#define AESDOUTCNT_OFS                           AES256_STAT_DOUTCNT_OFS         /*!< AESDOUTCNT Offset */
#define AESDOUTCNT_M                             AES256_STAT_DOUTCNT_MASK        /*!< Bytes read via AESADOUT */
#define AESDOUTCNT0                              AES256_STAT_DOUTCNT0            /*!< AESDOUTCNT Bit 0 */
#define AESDOUTCNT1                              AES256_STAT_DOUTCNT1            /*!< AESDOUTCNT Bit 1 */
#define AESDOUTCNT2                              AES256_STAT_DOUTCNT2            /*!< AESDOUTCNT Bit 2 */
#define AESDOUTCNT3                              AES256_STAT_DOUTCNT3            /*!< AESDOUTCNT Bit 3 */
/* AESAKEY[AESKEY0] Bits */
#define AESKEY0_OFS                              AES256_KEY_KEY0_OFS             /*!< AESKEY0 Offset */
#define AESKEY0_M                                AES256_KEY_KEY0_MASK            /*!< AES key byte n when AESAKEY is written as half-word */
#define AESKEY00                                 AES256_KEY_KEY00                /*!< AESKEY0 Bit 0 */
#define AESKEY01                                 AES256_KEY_KEY01                /*!< AESKEY0 Bit 1 */
#define AESKEY02                                 AES256_KEY_KEY02                /*!< AESKEY0 Bit 2 */
#define AESKEY03                                 AES256_KEY_KEY03                /*!< AESKEY0 Bit 3 */
#define AESKEY04                                 AES256_KEY_KEY04                /*!< AESKEY0 Bit 4 */
#define AESKEY05                                 AES256_KEY_KEY05                /*!< AESKEY0 Bit 5 */
#define AESKEY06                                 AES256_KEY_KEY06                /*!< AESKEY0 Bit 6 */
#define AESKEY07                                 AES256_KEY_KEY07                /*!< AESKEY0 Bit 7 */
/* AESAKEY[AESKEY1] Bits */
#define AESKEY1_OFS                              AES256_KEY_KEY1_OFS             /*!< AESKEY1 Offset */
#define AESKEY1_M                                AES256_KEY_KEY1_MASK            /*!< AES key byte n+1 when AESAKEY is written as half-word */
#define AESKEY10                                 AES256_KEY_KEY10                /*!< AESKEY1 Bit 0 */
#define AESKEY11                                 AES256_KEY_KEY11                /*!< AESKEY1 Bit 1 */
#define AESKEY12                                 AES256_KEY_KEY12                /*!< AESKEY1 Bit 2 */
#define AESKEY13                                 AES256_KEY_KEY13                /*!< AESKEY1 Bit 3 */
#define AESKEY14                                 AES256_KEY_KEY14                /*!< AESKEY1 Bit 4 */
#define AESKEY15                                 AES256_KEY_KEY15                /*!< AESKEY1 Bit 5 */
#define AESKEY16                                 AES256_KEY_KEY16                /*!< AESKEY1 Bit 6 */
#define AESKEY17                                 AES256_KEY_KEY17                /*!< AESKEY1 Bit 7 */
/* AESADIN[AESDIN0] Bits */
#define AESDIN0_OFS                              AES256_DIN_DIN0_OFS             /*!< AESDIN0 Offset */
#define AESDIN0_M                                AES256_DIN_DIN0_MASK            /*!< AES data in byte n when AESADIN is written as half-word */
#define AESDIN00                                 AES256_DIN_DIN00                /*!< AESDIN0 Bit 0 */
#define AESDIN01                                 AES256_DIN_DIN01                /*!< AESDIN0 Bit 1 */
#define AESDIN02                                 AES256_DIN_DIN02                /*!< AESDIN0 Bit 2 */
#define AESDIN03                                 AES256_DIN_DIN03                /*!< AESDIN0 Bit 3 */
#define AESDIN04                                 AES256_DIN_DIN04                /*!< AESDIN0 Bit 4 */
#define AESDIN05                                 AES256_DIN_DIN05                /*!< AESDIN0 Bit 5 */
#define AESDIN06                                 AES256_DIN_DIN06                /*!< AESDIN0 Bit 6 */
#define AESDIN07                                 AES256_DIN_DIN07                /*!< AESDIN0 Bit 7 */
/* AESADIN[AESDIN1] Bits */
#define AESDIN1_OFS                              AES256_DIN_DIN1_OFS             /*!< AESDIN1 Offset */
#define AESDIN1_M                                AES256_DIN_DIN1_MASK            /*!< AES data in byte n+1 when AESADIN is written as half-word */
#define AESDIN10                                 AES256_DIN_DIN10                /*!< AESDIN1 Bit 0 */
#define AESDIN11                                 AES256_DIN_DIN11                /*!< AESDIN1 Bit 1 */
#define AESDIN12                                 AES256_DIN_DIN12                /*!< AESDIN1 Bit 2 */
#define AESDIN13                                 AES256_DIN_DIN13                /*!< AESDIN1 Bit 3 */
#define AESDIN14                                 AES256_DIN_DIN14                /*!< AESDIN1 Bit 4 */
#define AESDIN15                                 AES256_DIN_DIN15                /*!< AESDIN1 Bit 5 */
#define AESDIN16                                 AES256_DIN_DIN16                /*!< AESDIN1 Bit 6 */
#define AESDIN17                                 AES256_DIN_DIN17                /*!< AESDIN1 Bit 7 */
/* AESADOUT[AESDOUT0] Bits */
#define AESDOUT0_OFS                             AES256_DOUT_DOUT0_OFS           /*!< AESDOUT0 Offset */
#define AESDOUT0_M                               AES256_DOUT_DOUT0_MASK          /*!< AES data out byte n when AESADOUT is read as half-word */
#define AESDOUT00                                AES256_DOUT_DOUT00              /*!< AESDOUT0 Bit 0 */
#define AESDOUT01                                AES256_DOUT_DOUT01              /*!< AESDOUT0 Bit 1 */
#define AESDOUT02                                AES256_DOUT_DOUT02              /*!< AESDOUT0 Bit 2 */
#define AESDOUT03                                AES256_DOUT_DOUT03              /*!< AESDOUT0 Bit 3 */
#define AESDOUT04                                AES256_DOUT_DOUT04              /*!< AESDOUT0 Bit 4 */
#define AESDOUT05                                AES256_DOUT_DOUT05              /*!< AESDOUT0 Bit 5 */
#define AESDOUT06                                AES256_DOUT_DOUT06              /*!< AESDOUT0 Bit 6 */
#define AESDOUT07                                AES256_DOUT_DOUT07              /*!< AESDOUT0 Bit 7 */
/* AESADOUT[AESDOUT1] Bits */
#define AESDOUT1_OFS                             AES256_DOUT_DOUT1_OFS           /*!< AESDOUT1 Offset */
#define AESDOUT1_M                               AES256_DOUT_DOUT1_MASK          /*!< AES data out byte n+1 when AESADOUT is read as half-word */
#define AESDOUT10                                AES256_DOUT_DOUT10              /*!< AESDOUT1 Bit 0 */
#define AESDOUT11                                AES256_DOUT_DOUT11              /*!< AESDOUT1 Bit 1 */
#define AESDOUT12                                AES256_DOUT_DOUT12              /*!< AESDOUT1 Bit 2 */
#define AESDOUT13                                AES256_DOUT_DOUT13              /*!< AESDOUT1 Bit 3 */
#define AESDOUT14                                AES256_DOUT_DOUT14              /*!< AESDOUT1 Bit 4 */
#define AESDOUT15                                AES256_DOUT_DOUT15              /*!< AESDOUT1 Bit 5 */
#define AESDOUT16                                AES256_DOUT_DOUT16              /*!< AESDOUT1 Bit 6 */
#define AESDOUT17                                AES256_DOUT_DOUT17              /*!< AESDOUT1 Bit 7 */
/* AESAXDIN[AESXDIN0] Bits */
#define AESXDIN0_OFS                             AES256_XDIN_XDIN0_OFS           /*!< AESXDIN0 Offset */
#define AESXDIN0_M                               AES256_XDIN_XDIN0_MASK          /*!< AES data in byte n when AESAXDIN is written as half-word */
#define AESXDIN00                                AES256_XDIN_XDIN00              /*!< AESXDIN0 Bit 0 */
#define AESXDIN01                                AES256_XDIN_XDIN01              /*!< AESXDIN0 Bit 1 */
#define AESXDIN02                                AES256_XDIN_XDIN02              /*!< AESXDIN0 Bit 2 */
#define AESXDIN03                                AES256_XDIN_XDIN03              /*!< AESXDIN0 Bit 3 */
#define AESXDIN04                                AES256_XDIN_XDIN04              /*!< AESXDIN0 Bit 4 */
#define AESXDIN05                                AES256_XDIN_XDIN05              /*!< AESXDIN0 Bit 5 */
#define AESXDIN06                                AES256_XDIN_XDIN06              /*!< AESXDIN0 Bit 6 */
#define AESXDIN07                                AES256_XDIN_XDIN07              /*!< AESXDIN0 Bit 7 */
/* AESAXDIN[AESXDIN1] Bits */
#define AESXDIN1_OFS                             AES256_XDIN_XDIN1_OFS           /*!< AESXDIN1 Offset */
#define AESXDIN1_M                               AES256_XDIN_XDIN1_MASK          /*!< AES data in byte n+1 when AESAXDIN is written as half-word */
#define AESXDIN10                                AES256_XDIN_XDIN10              /*!< AESXDIN1 Bit 0 */
#define AESXDIN11                                AES256_XDIN_XDIN11              /*!< AESXDIN1 Bit 1 */
#define AESXDIN12                                AES256_XDIN_XDIN12              /*!< AESXDIN1 Bit 2 */
#define AESXDIN13                                AES256_XDIN_XDIN13              /*!< AESXDIN1 Bit 3 */
#define AESXDIN14                                AES256_XDIN_XDIN14              /*!< AESXDIN1 Bit 4 */
#define AESXDIN15                                AES256_XDIN_XDIN15              /*!< AESXDIN1 Bit 5 */
#define AESXDIN16                                AES256_XDIN_XDIN16              /*!< AESXDIN1 Bit 6 */
#define AESXDIN17                                AES256_XDIN_XDIN17              /*!< AESXDIN1 Bit 7 */
/* AESAXIN[AESXIN0] Bits */
#define AESXIN0_OFS                              AES256_XIN_XIN0_OFS             /*!< AESXIN0 Offset */
#define AESXIN0_M                                AES256_XIN_XIN0_MASK            /*!< AES data in byte n when AESAXIN is written as half-word */
#define AESXIN00                                 AES256_XIN_XIN00                /*!< AESXIN0 Bit 0 */
#define AESXIN01                                 AES256_XIN_XIN01                /*!< AESXIN0 Bit 1 */
#define AESXIN02                                 AES256_XIN_XIN02                /*!< AESXIN0 Bit 2 */
#define AESXIN03                                 AES256_XIN_XIN03                /*!< AESXIN0 Bit 3 */
#define AESXIN04                                 AES256_XIN_XIN04                /*!< AESXIN0 Bit 4 */
#define AESXIN05                                 AES256_XIN_XIN05                /*!< AESXIN0 Bit 5 */
#define AESXIN06                                 AES256_XIN_XIN06                /*!< AESXIN0 Bit 6 */
#define AESXIN07                                 AES256_XIN_XIN07                /*!< AESXIN0 Bit 7 */
/* AESAXIN[AESXIN1] Bits */
#define AESXIN1_OFS                              AES256_XIN_XIN1_OFS             /*!< AESXIN1 Offset */
#define AESXIN1_M                                AES256_XIN_XIN1_MASK            /*!< AES data in byte n+1 when AESAXIN is written as half-word */
#define AESXIN10                                 AES256_XIN_XIN10                /*!< AESXIN1 Bit 0 */
#define AESXIN11                                 AES256_XIN_XIN11                /*!< AESXIN1 Bit 1 */
#define AESXIN12                                 AES256_XIN_XIN12                /*!< AESXIN1 Bit 2 */
#define AESXIN13                                 AES256_XIN_XIN13                /*!< AESXIN1 Bit 3 */
#define AESXIN14                                 AES256_XIN_XIN14                /*!< AESXIN1 Bit 4 */
#define AESXIN15                                 AES256_XIN_XIN15                /*!< AESXIN1 Bit 5 */
#define AESXIN16                                 AES256_XIN_XIN16                /*!< AESXIN1 Bit 6 */
#define AESXIN17                                 AES256_XIN_XIN17                /*!< AESXIN1 Bit 7 */

